/*

[ 아침 회의 ]

각자 일정표 작성 후 팀원들과 공유



[ 저녁 회의 ]

목표 :	플레이어 정보와 세부사항 정리 및 첫 날 짠 피피티 목차 내용의 슬라이드 모두 채우기.


1. 플레이어 정보

	윤은지	| 보스와 동일한 체력으로 시작.

	김선아	| 플레이어는 청소년 정도로. 
					  플레이어의 움직임은 IDLE, 이동, 공격, 점프, 사망, 활 쏘기, 검 휘두르기, 몽둥이 내려치기, 아이텝 줍기, 상자 옮기기, 열쇠 꼽기 




2. 게임 세부 기획

	윤은지	| 게임 맵에서 다음 단계로 넘어가기 위한 문은 모든 플레이어가 모여야지만 문이 열리도록 제한을 걸어둠.
						디퍼드 렌더링 기법 구현을 목표로 추가. -> 미궁 맵을 추가하여 눈 앞에 조금의 시야를 밝히기 위한 용도로.

	김선아	| 단순히 문을 통한 이동이 아니라 지형에 게곡을 추가해 주위에 있는 돌, 상자들을 물에 던저 밟고 지나갈 수 있도록 추가.

	김명훈	| 맵에서 벽 오브젝트로 길을 막고 퍼즐을 해결하면 벽이 사라지는 식의 구현.

	----->	채택된 아이디어
				보스와 동일한 체력으로 게임 시작.
				플레이어는 청소년 정도의 신체.
				플레이어의 움직임은 IDLE, 이동, 공격, 점프, 사망, 활 쏘기, 검 휘두르기, 몽둥이 내려치기, 아이텝 줍기, 상자 옮기기, 열쇠 꼽기.
				게임 맵에서 다음 단계로 넘어가기 위한 문들에서 모든 플레이어가 모여야 문이 열리도록 제한.
				주위 오브젝트를 이용해서 집어 들고 물 위로 던져 밟고 지나갈 수 있도록 추가 구현.
				길을 벽 오브젝트로 막아두고 퍼즐을 해결하면 앞을 막고 있던 벽이 사라지도록 설정.


>>	내일 기획서 최종 수정
*/