/*


[ 아침 회의 ]

각자 일정표 작성 후 팀원들과 공유

[ 저녁 회의 ]

목표 : 게임 장르 설정 및 계획서 작성

1. 게임 장르 설정

	김선아	|	퍼즐 요소와 rpg 요소를 합친 장르를 소개함.
						퍼즐 게임의 예시로 휴먼 폴플랫과 폴 가이즈, rpg 게임의 예시로 젤다 소개.
						스테이지 마다 다른 종류의 몬스터들을 배치하고 몬스터들마다 다른 공격패턴을 설정.

	김명훈	|	퍼즐 요소의 비중을 줄이고 잡몬스터, 보스 몬스터로 배치하여 rpg 요소의 비중을 늘린다.


2. 계획서 작성

	연구 목적과 연구 과제 수행 과정 및 방법 설정.
	연구 목적은 다중 접속 퍼즐 RPG로 설정. 

	윤은지	|	그래픽 처리 장치 활용을 연구 과제로 제안


3. 게임 세부 내용 구상
	
	김선아	|	초기에는 무기가 없이 시작했다가 이동하면서 상자를 부셔서 무기 획득.
						다양한 무기들을 번갈아가면서 사용 가능하게끔 구현

	윤은지	|

	김명훈	|	다양한 무기 구현. 
						전투와 퍼즐을 섞어서 진행하다가 마지막에 보스전 실행
						특수한 상황 (보스 등장, 혹은 퍼즐을 풀었을 때) 카메라 시점 변환

>>	내일까지 각자 생각해본 장르가 있다면 정리해서 팀원들에게 소개
*/